bopamo/lhend-code-collection/MSP430G2553_RAM_FUNC/MSP430G2553_RAM_FUNC_IAR/ram_func_iar.c
/******************************************************************************
* Copyright (c) 2013, Leo Hendrawan
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*    * Redistributions of source code must retain the above copyright
*      notice, this list of conditions and the following disclaimer.
*    * Redistributions in binary form must reproduce the above copyright
*      notice, this list of conditions and the following disclaimer in the
*      documentation and/or other materials provided with the distribution.
*    * Neither the name of the MSS PROJECT nor the names of its contributors
*      may be used to endorse or promote products derived from this software
*      without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
* THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
* PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE MSS PROJECT OR ITS
* CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
* EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
* OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
* WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
* OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
* ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
******************************************************************************/

/**************************************************************************//**
*
* @file     ram_func_iar.c
*
* @brief    example code to run function on RAM with IAR compiler
*
* @version  0.1
*
* @author   Leo Hendrawan
*
* @remark
*  - target device: MSP430G2553
*  - IDE: IAR EWB MSP430 v5.60
*
******************************************************************************/

//*****************************************************************************
// Include section
//*****************************************************************************
#include <stdint.h>
#include <string.h>
#include <msp430.h>

//*****************************************************************************
// Global variables
//*****************************************************************************


//*****************************************************************************
// Macros (defines), data types, static variables
//*****************************************************************************

#define DELAY_CYCLES   (60000)

//*****************************************************************************
// Internal function declarations
//*****************************************************************************

void main_loop(void);
void blink_led1(void);
void blink_led2(void);

//*****************************************************************************
// External functions
//*****************************************************************************

/**************************************************************************//**
*
* main
*
* @brief      main function
*
* @param      -
*
* @return     -
*
******************************************************************************/
void main(void)
{
  // Set DCOCLK to 1MHz
  DCOCTL = 0x00;
  BCSCTL1 = CALBC1_1MHZ;
  DCOCTL = CALDCO_1MHZ;
  
  // source ACLK with internal VLO clock
  BCSCTL3 |= LFXT1S_2;

  // set all pin as output low
  P1DIR = 0xFF;
  P1OUT = 0x00;
  P2DIR = 0xFF;
  P2OUT = 0x00;

  // setup Timer A0 CCR0 interrupt
  TACCTL0 = CCIE;
  TACCR0 = 10000;
  TACTL = TASSEL_1 + MC_1 + TACLR;

  // goto main loop - shall never return
  main_loop();
  
  while(1);
}

//*****************************************************************************
// Internal functions
//*****************************************************************************

/**************************************************************************//**
*
* main_loop
*
* @brief      main loop function
*
* @param      -
*
* @return     -
*
******************************************************************************/
__ramfunc void main_loop(void)
{
  while(1)
  {
    // enable interrupt and sleep
    __bis_SR_register(LPM3_bits + GIE);

    // blink LED2
    blink_led2();
  }
}

/**************************************************************************//**
*
* blink_led1
*
* @brief      blink LED 1
*
* @param      -
*
* @return     -
*
******************************************************************************/
__ramfunc void blink_led1(void)
{
  // blink P1.0 bit
  P1OUT |= BIT0;
  __delay_cycles(DELAY_CYCLES);
  P1OUT &= ~BIT0;
}

/**************************************************************************//**
*
* blink_led2
*
* @brief      blink LED 2
*
* @param      -
*
* @return     -
*
******************************************************************************/
__ramfunc void blink_led2(void)
{
  // blink P1.6 bit
  P1OUT |= BIT6;
  __delay_cycles(DELAY_CYCLES);
  P1OUT &= ~BIT6;
}

/**************************************************************************//**
*
* __low_level_init
*
* @brief      C pre-init function
*
* @param      -
*
* @return     1 to enable C data initialization
*
******************************************************************************/
int __low_level_init(void)
{
  // stop WDT
  WDTCTL = WDTPW + WDTHOLD;

  // Perform C/C++ global data initialization
  return 1;
}

/**************************************************************************//**
*
* TIMER_ISR
*
* @brief      Timer A0 CCR0 ISR
*
* @param      -
*
* @return     -
*
******************************************************************************/
#pragma vector=TIMER0_A0_VECTOR
__ramfunc __interrupt void TIMER_ISR(void)
{
  // blink LED1
  blink_led1();

  // wake up CPU
  __bic_SR_register_on_exit(LPM3_bits);
}
